app/controllers/employee_det_controller.rb

	def new
		@employee = EmployeeDetail.new(employee_params)
		phone_numbers = employee_params["phonenumber"].split(',')
		invalid_phone = false
		phone_numbers.each do |phn|
			puts "phone number = #{phn}"
			if /^[0-9]{10,15}$/.match(phn).nil?
				#render json: {:message => "Invalid phone number provided"}, :status => 422
				invalid_phone = true
				break
			end
		end
		if invalid_phone == false && @employee.save
---
INSERT INTO "employee_details" ("employee_id", "first_name", "last_name", "email", "phonenumber", "date_of_joining", "salary", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

	def view
		emp_det = EmployeeDetail.find_by(employee_id: view_params[:employee_id])
---
SELECT "employee_details".* FROM "employee_details" WHERE "employee_details"."employee_id" = $1 LIMIT $2  [["employee_id", "EMP06"], ["LIMIT", 1]]

	def calculate_tax
		emp_det = EmployeeDetail.find_by(employee_id: tax_params[:employee_id])
---
SELECT "employee_details".* FROM "employee_details" WHERE "employee_details"."employee_id" = $1 LIMIT $2  [["employee_id", "EMP06"], ["LIMIT", 1]]